#
########################################## LIST COMPREHENSION EXAMPLES #################################

######################### 7 ############################
t = ["– Скажи-ка, дядя, ведь не даром",
    "Я Python выучил с каналом",
    "Балакирев что раздавал?",
    "Ведь были ж заданья боевые,",
    "Да, говорят, еще какие!",
    "Недаром помнит вся Россия",
    "Как мы рубили их тогда!"
    ]

a = [ [x for x in x.split() if len(x) > 3] for x in t ]

# Output: [['Скажи-ка,', 'дядя,', 'ведь', 'даром'], ['Python', 'выучил', 'каналом'], ['Балакирев', 'раздавал?'], 
#           ['Ведь', 'были', 'заданья', 'боевые,'], ['говорят,', 'какие!'], ['Недаром', 'помнит', 'Россия'], ['рубили', 'тогда!']]

#########################################################

######################### 8 ############################
lst = [x**2 for x in [x for x in range(1,6)] ]

# Output: [1, 4, 9, 16, 25]
#########################################################


######################### 9 ############################
# Транспонирование матрицы

lst_in = [[1, 2, 3], [4, 5, 6], [7, 8, 9], [5, 4, 3]]
A: list = [ [x[number] for x in lst_in] for number in range(len(lst_in[0])) ]

# before
for row in lst_in:
    print(*row)
"""   
1 2 3
4 5 6  
7 8 9  
5 4 3
"""

# after
for row in A:
    print(*row)
"""
1 4 7 5
2 5 8 4
3 6 9 3
"""

